# Gözlem ve Değişken Seçimi: loc & iloc

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    25    29     7
1    16    20    24
2    21    14    28
3    13    22    25
4     9    25    19
5    22    18     4
6     7     3    12
7    26    23     6
8    13    13    13
9    15    29     4

In [2]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [19]:
df.loc[0:3,'var1':'var2']

   var1  var2
0    25    29
1    16    20
2    21    14
3    13    22

In [4]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [22]:
df.iloc[0:3,0:2]

   var1  var2
0    25    29
1    16    20
2    21    14

In [6]:
df.iloc[0,0]

25

In [7]:
df

   var1  var2  var3
0    25    29     7
1    16    20    24
2    21    14    28
3    13    22    25
4     9    25    19
5    22    18     4
6     7     3    12
7    26    23     6
8    13    13    13
9    15    29     4

In [8]:
df.iloc[:3,:2]

   var1  var2
0    25    29
1    16    20
2    21    14

In [9]:
df.loc[0:3, "var3"]

0     7
1    24
2    28
3    25
Name: var3, dtype: int32

In [10]:
df.loc[0:3, "var3"]

0     7
1    24
2    28
3    25
Name: var3, dtype: int32

In [11]:
df.iloc[0:3]["var3"]

0     7
1    24
2    28
Name: var3, dtype: int32